import ismsIcon from '../../assets/icon/isms.png';

class MillieFooter extends HTMLElement {
  connectedCallback() {
    this.innerHTML = `
        <style>
          /* 추가로 설정하신 CSS */
          .list-remove summary::-webkit-details-marker {
            display: none;
          }
        </style>
        <footer class="text-(--light-text-03) max-w-[1400px] mx-auto mb-[4.875rem] px-4 xl:px-0 lg:mb-0">
          <div class="flex items-center justify-between">
            <h2 class="text-black font-[500]">(주) 윌리의 서재</h2>
            <ul class="flex gap-2">
              <li>
                <a href="#" aria-label="윌리의 서재 공식 인스타그램 바로가기">
                  <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                    <title>윌리의 서재 공식 인스타 바로가기</title>
                    <path d="M14.829 6.302c-.738-.034-.96-.04-2.829-.04s-2.09.007-2.828.04c-1.899.087-2.783.986-2.87 2.87-.033.738-.041.959-.041 2.828s.008 2.09.041 2.829c.087 1.879.967 2.783 2.87 2.87.737.033.959.041 2.828.041 1.87 0 2.091-.007 2.829-.041 1.899-.086 2.782-.988 2.87-2.87.033-.738.04-.96.04-2.829s-.007-2.09-.04-2.828c-.088-1.883-.973-2.783-2.87-2.87zm-2.829 9.293c-1.985 0-3.595-1.609-3.595-3.595 0-1.985 1.61-3.594 3.595-3.594s3.595 1.609 3.595 3.594c0 1.985-1.61 3.595-3.595 3.595zm3.737-6.491c-.464 0-.84-.376-.84-.84 0-.464.376-.84.84-.84.464 0 .84.376.84.84 0 .463-.376.84-.84.84zm-1.404 2.896c0 1.289-1.045 2.333-2.333 2.333s-2.333-1.044-2.333-2.333c0-1.289 1.045-2.333 2.333-2.333s2.333 1.044 2.333 2.333zm-2.333-12c-6.627 0-12 5.373-12 12s5.373 12 12 12 12-5.373 12-12-5.373-12-12-12zm6.958 14.886c-.115 2.545-1.532 3.955-4.071 4.072-.747.034-.986.042-2.887.042s-2.139-.008-2.886-.042c-2.544-.117-3.955-1.529-4.072-4.072-.034-.746-.042-.985-.042-2.886 0-1.901.008-2.139.042-2.886.117-2.544 1.529-3.955 4.072-4.071.747-.035.985-.043 2.886-.043s2.14.008 2.887.043c2.545.117 3.957 1.532 4.071 4.071.034.747.042.985.042 2.886 0 1.901-.008 2.14-.042 2.886z" fill="#444444"></path>
                  </svg>
                </a>
              </li>
              <li>
                <a href="#" aria-label="윌리의 서재 공식 유튜브 바로가기">
                  <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                    <title>윌리의 서재 공식 유튜브 바로가기</title>
                    <path d="M12 0c-6.627 0-12 5.373-12 12s5.373 12 12 12 12-5.373 12-12-5.373-12-12-12zm4.441 16.892c-2.102.144-6.784.144-8.883 0-2.276-.156-2.541-1.27-2.558-4.892.017-3.629.285-4.736 2.558-4.892 2.099-.144 6.782-.144 8.883 0 2.277.156 2.541 1.27 2.559 4.892-.018 3.629-.285 4.736-2.559 4.892zm-6.441-7.234l4.917 2.338-4.917 2.346v-4.684z" fill="#444"></path>
                  </svg>
                </a>
              </li>
              <li>
                <a href="#" aria-label="윌리의 서재 공식 카카오 플러스 친구 바로가기">
                  <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 256 256">
                    <title>윌리의 서재 공식 카카오 플러스 친구 바로가기</title>
                    <path fill="none" d="M256 236c0 11.046-8.954 20-20 20H20c-11.046 0-20-8.954-20-20V20C0 8.954 8.954 0 20 0h216c11.046 0 20 8.954 20 20v216z"></path>
                    <path d="M128 36C70.562 36 24 72.713 24 118c0 29.279 19.466 54.97 48.748 69.477-1.593 5.494-10.237 35.344-10.581 37.689 0 0-.207 1.762.934 2.434s2.483.15 2.483.15c3.272-.457 37.943-24.811 43.944-29.04 5.995.849 12.168 1.29 18.472 1.29 57.438 0 104-36.712 104-82 0-45.287-46.562-82-104-82z" fill="#444"></path>
                    <path d="M70.5 146.625c-3.309 0-6-2.57-6-5.73V105.25h-9.362c-3.247 0-5.888-2.636-5.888-5.875s2.642-5.875 5.888-5.875h30.724c3.247 0 5.888 2.636 5.888 5.875s-2.642 5.875-5.888 5.875H76.5v35.645c0 3.16-2.691 5.73-6 5.73zM123.112 146.547c-2.502 0-4.416-1.016-4.993-2.65l-2.971-7.778-18.296-.001-2.973 7.783c-.575 1.631-2.488 2.646-4.99 2.646a9.155 9.155 0 0 1-3.814-.828c-1.654-.763-3.244-2.861-1.422-8.52l14.352-37.776c1.011-2.873 4.082-5.833 7.99-5.922 3.919.088 6.99 3.049 8.003 5.928l14.346 37.759c1.826 5.672.236 7.771-1.418 8.532a9.176 9.176 0 0 1-3.814.827c-.001 0 0 0 0 0zm-11.119-21.056L106 108.466l-5.993 17.025h11.986zM138 145.75c-3.171 0-5.75-2.468-5.75-5.5V99.5c0-3.309 2.748-6 6.125-6s6.125 2.691 6.125 6v35.25h12.75c3.171 0 5.75 2.468 5.75 5.5s-2.579 5.5-5.75 5.5H138zM171.334 146.547c-3.309 0-6-2.691-6-6V99.5c0-3.309 2.691-6 6-6s6 2.691 6 6v12.896l16.74-16.74c.861-.861 2.044-1.335 3.328-1.335 1.498 0 3.002.646 4.129 1.772 1.051 1.05 1.678 2.401 1.764 3.804.087 1.415-.384 2.712-1.324 3.653l-13.673 13.671 14.769 19.566a5.951 5.951 0 0 1 1.152 4.445 5.956 5.956 0 0 1-2.328 3.957 5.94 5.94 0 0 1-3.609 1.211 5.953 5.953 0 0 1-4.793-2.385l-14.071-18.644-2.082 2.082v13.091a6.01 6.01 0 0 1-6.002 6.003z" fill="#fff"></path>
                  </svg>
                </a>
              </li>
            </ul>
          </div>

          <details class="block group text-xs text-gray-500 mb-6 mt-2 list-remove">
            <summary class="flex items-center gap-1 cursor-pointer select-none justify-start">
              사업자 정보 펼쳐보기
              <span class="transition-transform group-open:rotate-180">&#9660;</span>
            </summary>
            <ul class="text-sm/7">
              <li><strong>대표이사:</strong> 박현진</li>
              <li><strong>사업자등록번호:</strong> 423-88-00370</li>
              <li><strong>호스팅 제공자:</strong> (주)윌리의 서재</li>
              <li><strong>통신판매업 신고번호:</strong> 2016-서울마포-2012호</li>
              <li>
                <strong>주소:</strong>
                <a href="https://naver.me/x5GfOMVv" target="_blank" rel="noopener noreferrer" aria-label="서울특별시 마포구 양화로 45, 16층 (메세나폴리스 세아타워) 위치 보기 (새 창에서 열림)">
                  서울특별시 마포구 양화로 45, 16층 (메세나폴리스 세아타워)
                </a>
              </li>
              <li>
                <strong>개인정보보호 관련 문의:</strong>
                <a href="mailto:privacy@millie.town" aria-label="개인정보 보호 관련 문의 이메일 (privacy@millie.town)"> privacy@millie.town </a>
              </li>
              <li>
                <strong>마케팅 제휴 문의:</strong>
                <a href="mailto:business@millie.town" aria-label="business@millie.town으로 이메일 보내기"> business@millie.town </a>
              </li>
              <li>
                <strong>고객센터:</strong>
                <a href="tel:070-7510-5415" aria-label="070-7510-5415로 전화 걸기"> 070-7510-5415 </a>
              </li>
            </ul>
          </details>

          <ul class="flex flex-wrap gap-3">
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 이용약관">
                이용약관
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1 font-bold" aria-label="더보기: 개인정보처리방침">
                개인정보처리방침
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 청소년보호정책">
                청소년보호정책
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 고객센터">
                고객센터
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 환불신청">
                환불신청
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: B2B 문의">
                B2B 문의
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 콘텐츠 제휴문의">
                콘텐츠 제휴문의
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 저작권/도서오류 신고">
                저작권/도서오류 신고
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 뷰어 다운로드">
                뷰어 다운로드
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 종료 예정 도서">
                종료 예정 도서
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
            <li>
              <a href="#" class="inline-flex items-center gap-1" aria-label="더보기: 회사 소개">
                회사 소개
                <svg width="16" height="16" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" role="img" aria-hidden="true">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M8.29289 19.7071C8.68342 20.0976 9.31658 20.0976 9.70711 19.7071L16.7071 12.7071C17.0976 12.3166 17.0976 11.6834 16.7071 11.2929L9.70711 4.29289C9.31658 3.90237 8.68342 3.90237 8.29289 4.29289C7.90237 4.68342 7.90237 5.31658 8.29289 5.70711L14.5858 12L8.29289 18.2929C7.90237 18.6834 7.90237 19.3166 8.29289 19.7071Z" fill="#444444"></path>
                </svg>
              </a>
            </li>
          </ul>
          <p class="mt-4 mb-6">Copyright &copy; 2025 밀리의 서재 All Rights Reserved.</p>
          <ul class="list-style flex flex-wrap items-center">
            <li class="inline-flex items-center">
              <img src="${ismsIcon}" alt="ISMS 인증 로고" class="w-16" />
              <span>정보보호관리체계 ISMS 인증획득</span>
            </li>
            <li>인증범위 : 밀리의 서재 대고객 서비스</li>
            <li>유효기간 : 2023-05-03~2026-05-02</li>
          </ul>
        </footer>
      `;
  }
}

customElements.define('millie-footer', MillieFooter);
